ERROR_MESS = 'Виникла помилка.'
NO_DATA = 'Даних немає.'
INCORRECT_DATA = 'Неправильно введено дані.'
NO_FILE = 'Файл не знайдений.'

RETURN_TO_MAIN = ["Повернутись в головне меню",
                  "Завершити роботу"]

MAIN_MENU = [
        "Введення даних задачі",
        "Розв'язати задачу всіма розробленими алгоритмами",
        "Вивести дані задачі",
        "Вивести розв'язки задачі",
        "Провести експерименти",
        "Завершити роботу"
        ]

DATA_MENU = ["Ввести дані самостійно",
             "Зчитати з файлу",
             "Згенерувати",
             "Повернутись в головне меню"]

EXPERIMENT_QUESTION = "Вибір експерименту"
EXPERIMENT_RUN = "Запуск..."
EXPERIMENT_DONE = "Готово!"

RESULT_MENU = ["Вивести дані у консоль",
                 "Записати дані у файлі",
                 "Повернутись в головне меню"]

EXPERIMENT_STR = "Експеримент"
EXPERIMENT_DESC = ["Визначення значення параметра умови завершення роботи алгоритму GA (t) в залежності від розмірності вхідної задачі",
                   "Дослідження впливу кількості особин в популяції (I) на точність роботи GA",
                   "Дослідження впливу розмірності задач на точність та час роботи жадібного та генетичного GA алгоритмів",
                   "Провести усі вище зазначені експерименти"]

PARAMS_CHOICE = ["Використати параметри за замовчуванням",
                 "Ввести параметри вручну"]

CHOICE_STR = 'Вибір: '
CHOICE_VALUES = 'Введіть: '

ALGO_1 = "Жадібний алгоритм"
ALGO_2 = "Генетичний алгоритм"

RESULT_STR = ["Результат роботи: ",
              "Значення ЦФ: "]

INFO = f"[bold magenta]Курсова робота з 'Дослідження операцій в інформаційно-управляючих системах' [bold blue]Кіселар Владислава, Ковалюк Валерії, Топки Тіни, Черепні Юрія[/bold blue] з групи ІС-32.[/bold magenta]"
TOPIC = "Задача вибору сценаріїв розширення потужностей у транспортній моделі з бюджетним обмеженням"