"""
Загалом планується проведення трьох експериментів:
1. визначення значення параметра умови завершення роботи алгоритму GA (t) в залежності від розмірності вхідної задачі;
2. дослідження впливу кількості особин в популяції (I) на точність роботи GA;
3. дослідження впливу розмірності задач на точність та час роботи жадібного та генетичного GA алгоритмів.
"""

# 1. визначення значення параметра умови завершення роботи алгоритму GA (t) в залежності від розмірності вхідної задачі;
def experiment_1():
    """
    Параметри:
    fixed_generations (int): Кількість ітерацій (режим GA_fixed для експериментів).
    pop_size (int): Розмір популяції (парне число).
    elite_percent (float): Частка елітних особин (від 0 до 1).
    mutation_rate (float): Ймовірність мутації (від 0 до 1).
    """
    def trial():
        return
    return

# 2. дослідження впливу кількості особин в популяції (I) на точність роботи GA;
def experiment_2():
    """
    Параметри:
    fixed_generations (int): Кількість ітерацій (режим GA_fixed для експериментів).
    pop_size_list (list of int): Масив розмірів популяції (парні числа).
    max_stagnation (int): Максимальна кількість ітерацій без покращення.
    elite_percent (float): Частка елітних особин (від 0 до 1).
    mutation_rate (float): Ймовірність мутації (від 0 до 1).
    """
    return

# 3. дослідження впливу розмірності задач на точність та час роботи жадібного та генетичного GA алгоритмів.
def experiment_3():
    """
    Параметри (для GA):
    fixed_generations (int): Кількість ітерацій (режим GA_fixed для експериментів).
    v_scale (list of int): Масив значень інтегрального коефіцієнта масштабу.
    pop_size (int): Розмір популяції (парне число).
    max_stagnation (int): Максимальна кількість ітерацій без покращення.
    elite_percent (float): Частка елітних особин (від 0 до 1).
    mutation_rate (float): Ймовірність мутації (від 0 до 1).
    """
    return
